index.org
#+options: ':t *:t -:t ::t <:t H:3 \n:nil ^:t arch:headline author:t
#+options: broken-links:nil c:nil creator:nil d:(not "LOGBOOK") date:t e:t
#+options: email:nil expand-links:t f:t inline:t num:t p:nil pri:nil prop:nil
#+options: stat:t tags:t tasks:t tex:t timestamp:t title:t toc:t todo:t |:t
#+title: Qtile Configuration
#+date: <2026-05-11 Mon>
#+author: Kristian Alexander P
#+email: alexforsale@yahoo.com
#+language: en
#+select_tags: export
#+exclude_tags: noexport
#+creator: Emacs 30.2 (Org mode 9.8.4)
#+cite_export:
#+setupfile: https://fniessen.github.io/org-html-themes/org/html-theme-readtheorg.setup
#+export_file_name: index.html
* Qtile
** config.py
:PROPERTIES:
:header-args: :tangle .config/qtile/config.py :mkdirp t
:END:
*** imports
#+begin_src python -n
import os
from collections.abc import Callable
import shutil

import libqtile.resources
from libqtile import bar, layout, qtile, widget, hook
from libqtile.config import Click, Drag, Group, Key, Match, Output, Screen
from libqtile.lazy import lazy
from libqtile.utils import guess_terminal
#+end_src
*** Set the mod variable
#+begin_src python +n
mod = "mod4"
#+end_src
*** Set the terminal variable
#+begin_src python +n
terminal = guess_terminal()
#+end_src
*** guess_browser() function
#+begin_src python +n

def guess_browser():
    """"Get currently available browser."""
    for b in ["firefox", "brave-browser", "google-chrome-stable"]:
        if shutil.which(b):
            return b


browser = guess_browser()
#+end_src
*** mail variable
#+begin_src python +n
mail = "thunderbird"
#+end_src
*** filemanager variable
#+begin_src python +n
filemanager = "thunar"
#+end_src
