index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2026-05-11 Mon 08:47 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Qtile Configuration</title>
<meta name="author" content="Kristian Alexander P" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/readtheorg.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/code-copy.css"/>
<link rel="stylesheet" type="text/css" href="src/readtheorg_theme/css/search.css"/>
</head>
<body>
<div id="content" class="content">
<h1 class="title">Qtile Configuration</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgfc60f99">1. Qtile</a>
<ul>
<li><a href="#org730ce48">1.1. config.py</a>
<ul>
<li><a href="#org40523a5">1.1.1. imports</a></li>
<li><a href="#org882c5b8">1.1.2. Set the mod variable</a></li>
<li><a href="#orgd3798d2">1.1.3. Set the terminal variable</a></li>
<li><a href="#org9587706">1.1.4. guess<sub>browser</sub>() function</a></li>
<li><a href="#orgac16964">1.1.5. mail variable</a></li>
<li><a href="#org58debdf">1.1.6. filemanager variable</a></li>
<li><a href="#org76f4f02">1.1.7. Keys</a></li>
<li><a href="#orgec7ae0f">1.1.8. Switch VTs in wayland</a></li>
<li><a href="#org67ea8f4">1.1.9. groups</a></li>
<li><a href="#org63e55f3">1.1.10. layouts</a></li>
<li><a href="#orgd2840a1">1.1.11. widget and extension defaults</a></li>
<li><a href="#org56f7d8b">1.1.12. screens</a></li>
<li><a href="#org8b47422">1.1.13. mouse - drag floating layouts</a></li>
<li><a href="#org5f024a2">1.1.14. misc</a></li>
<li><a href="#org9e81537">1.1.15. float rules</a></li>
<li><a href="#orgcb50a14">1.1.16. startups</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orga3d7dba">2. Picom</a>
<ul>
<li><a href="#org8e68ce1">2.1. picom.conf</a>
<ul>
<li><a href="#org40aaa20">2.1.1. shadows</a></li>
<li><a href="#org2da2939">2.1.2. fading</a></li>
<li><a href="#orgdabba8b">2.1.3. transparency / opacity</a></li>
<li><a href="#org3301ce8">2.1.4. corners</a></li>
<li><a href="#org0e97748">2.1.5. blur</a></li>
<li><a href="#orgb53e52f">2.1.6. general settings</a></li>
<li><a href="#org7a810da">2.1.7. rules</a></li>
<li><a href="#orgd2d70fd">2.1.8. imports</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org7fde9d4">3. xdg-desktop-portal</a>
<ul>
<li><a href="#org0e8b526">3.1. qtile-portal.conf</a></li>
</ul>
</li>
<li><a href="#orge52a281">4. Rofi</a>
<ul>
<li><a href="#orgbe2031a">4.1. config.rasi</a></li>
<li><a href="#org41b021c">4.2. catppuccin-default.rasi</a></li>
<li><a href="#orgc87a0c7">4.3. themes/catppuccin-mocha.rasi</a></li>
</ul>
</li>
<li><a href="#org8645707">5. GTK-3</a>
<ul>
<li><a href="#orgce6286b">5.1. settings.ini</a></li>
</ul>
</li>
<li><a href="#org603beca">6. GTK-4</a>
<ul>
<li><a href="#orge7491f2">6.1. settings.ini</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-orgfc60f99" class="outline-2">
<h2 id="orgfc60f99"><span class="section-number-2">1.</span> Qtile</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org730ce48" class="outline-3">
<h3 id="org730ce48"><span class="section-number-3">1.1.</span> config.py</h3>
<div class="outline-text-3" id="text-1-1">
</div>
<div id="outline-container-org40523a5" class="outline-4">
<h4 id="org40523a5"><span class="section-number-4">1.1.1.</span> imports</h4>
<div class="outline-text-4" id="text-1-1-1">
<div class="org-src-container">
<pre class="src src-python"><span class="linenr">1: </span><span style="color: #4169e1;">import</span> os
<span class="linenr">2: </span><span style="color: #4169e1;">from</span> collections.abc <span style="color: #4169e1;">import</span> Callable
<span class="linenr">3: </span><span style="color: #4169e1;">import</span> shutil
<span class="linenr">4: </span>
<span class="linenr">5: </span><span style="color: #4169e1;">import</span> libqtile.resources
<span class="linenr">6: </span><span style="color: #4169e1;">from</span> libqtile <span style="color: #4169e1;">import</span> bar, layout, qtile, widget, hook
<span class="linenr">7: </span><span style="color: #4169e1;">from</span> libqtile.config <span style="color: #4169e1;">import</span> Click, Drag, Group, Key, Match, Output, Screen
<span class="linenr">8: </span><span style="color: #4169e1;">from</span> libqtile.lazy <span style="color: #4169e1;">import</span> lazy
<span class="linenr">9: </span><span style="color: #4169e1;">from</span> libqtile.utils <span style="color: #4169e1;">import</span> guess_terminal
</pre>
</div>
</div>
</div>
<div id="outline-container-org882c5b8" class="outline-4">
<h4 id="org882c5b8"><span class="section-number-4">1.1.2.</span> Set the mod variable</h4>
<div class="outline-text-4" id="text-1-1-2">
<div class="org-src-container">
<pre class="src src-python"><span class="linenr">10: </span><span style="color: #b8860b;">mod</span> = <span style="color: #bc8f8f;">"mod4"</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgd3798d2" class="outline-4">
<h4 id="orgd3798d2"><span class="section-number-4">1.1.3.</span> Set the terminal variable</h4>
<div class="outline-text-4" id="text-1-1-3">
<div class="org-src-container">
<pre class="src src-python"><span class="linenr">11: </span><span style="color: #b8860b;">terminal</span> = guess_terminal()
</pre>
</div>
</div>
</div>
<div id="outline-container-org9587706" class="outline-4">
<h4 id="org9587706"><span class="section-number-4">1.1.4.</span> guess<sub>browser</sub>() function</h4>
<div class="outline-text-4" id="text-1-1-4">
<div class="org-src-container">
<pre class="src src-python"><span class="linenr">12: </span>
<span class="linenr">13: </span><span style="color: #4169e1;">def</span> <span style="color: #0000ff;">guess_browser</span>():
<span class="linenr">14: </span>    <span style="color: #bc8f8f;">""""Get currently available browser."""</span>
<span class="linenr">15: </span>    <span style="color: #4169e1;">for</span> b <span style="color: #4169e1;">in</span> [<span style="color: #bc8f8f;">"firefox"</span>, <span style="color: #bc8f8f;">"brave-browser"</span>, <span style="color: #bc8f8f;">"google-chrome-stable"</span>]:
<span class="linenr">16: </span>        <span style="color: #4169e1;">if</span> shutil.which(b):
<span class="linenr">17: </span>            <span style="color: #4169e1;">return</span> b
<span class="linenr">18: </span>
<span class="linenr">19: </span>
<span class="linenr">20: </span><span style="color: #b8860b;">browser</span> = guess_browser()
</pre>
</div>
</div>
</div>
<div id="outline-container-orgac16964" class="outline-4">
<h4 id="orgac16964"><span class="section-number-4">1.1.5.</span> mail variable</h4>
<div class="outline-text-4" id="text-1-1-5">
<div class="org-src-container">
<pre class="src src-python"><span class="linenr">21: </span><span style="color: #b8860b;">mail</span> = <span style="color: #bc8f8f;">"thunderbird"</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org58debdf" class="outline-4">
<h4 id="org58debdf"><span class="section-number-4">1.1.6.</span> filemanager variable</h4>
<div class="outline-text-4" id="text-1-1-6">
<div class="org-src-container">
<pre class="src src-python"><span class="linenr">22: </span><span style="color: #b8860b;">filemanager</span> = <span style="color: #bc8f8f;">"thunar"</span>
</pre>
</div>
</div>
</div>
