index.org
*** Keys
#+begin_src python +n
keys = [
    # A list of available commands that can be bound to keys can be found
    # at https://docs.qtile.org/en/latest/manual/config/lazy.html
    # Switch between windows
    Key([mod], "h", lazy.layout.left(), desc="Move focus to left"),
    Key([mod], "l", lazy.layout.right(), desc="Move focus to right"),
    Key([mod], "j", lazy.layout.down(), desc="Move focus down"),
    Key([mod], "k", lazy.layout.up(), desc="Move focus up"),
    Key([mod], "space", lazy.layout.next(), desc="Move window focus to other window"),
    Key(["mod1"], "Tab", lazy.layout.next(), desc="Move window focus to other window"),
    # Move windows between left/right columns or move up/down in current stack.
    # Moving out of range in Columns layout will create new column.
    Key([mod, "shift"], "h", lazy.layout.shuffle_left(), desc="Move window to the left"),
    Key([mod, "shift"], "l", lazy.layout.shuffle_right(), desc="Move window to the right"),
    Key([mod, "shift"], "j", lazy.layout.shuffle_down(), desc="Move window down"),
    Key([mod, "shift"], "k", lazy.layout.shuffle_up(), desc="Move window up"),
    # Grow windows. If current window is on the edge of screen and direction
    # will be to screen edge - window would shrink.
    Key([mod, "control"], "h", lazy.layout.grow_left(), desc="Grow window to the left"),
    Key([mod, "control"], "l", lazy.layout.grow_right(), desc="Grow window to the right"),
    Key([mod, "control"], "j", lazy.layout.grow_down(), desc="Grow window down"),
    Key([mod, "control"], "k", lazy.layout.grow_up(), desc="Grow window up"),
    Key([mod], "n", lazy.layout.normalize(), desc="Reset all window sizes"),
    # Toggle between split and unsplit sides of stack.
    # Split = all windows displayed
    # Unsplit = 1 window displayed, like Max layout, but still with
    # multiple stack panes
    Key(
        [mod, "shift"],
        "Return",
        lazy.layout.toggle_split(),
        desc="Toggle between split and unsplit sides of stack",
    ),
    # Toggle between different layouts as defined below
    Key([mod], "Tab", lazy.screen.toggle_group(), desc="Toggle between groups"),
    Key([mod, "mod1"], "Tab", lazy.next_layout(), desc="Toggle between layouts"),
    # Key([mod], "w", lazy.window.kill(), desc="Kill focused window"),
    Key(
        [mod],
        "f",
        lazy.window.toggle_fullscreen(),
        desc="Toggle fullscreen on the focused window",
    ),
    Key([mod], "t", lazy.window.toggle_floating(), desc="Toggle floating on the focused window"),
    Key([mod, "control"], "r", lazy.reload_config(), desc="Reload the config"),
    Key([mod, "control"], "q", lazy.shutdown(), desc="Shutdown Qtile"),
    Key([mod], "r", lazy.spawncmd(), desc="Spawn a command using a prompt widget"),
    Key([mod], "bracketleft", lazy.to_screen(0)),
    Key([mod], "bracketright", lazy.to_screen(1)),

    Key([], "XF86AudioRaiseVolume",
        lazy.spawn("pactl set-sink-volume @DEFAULT_SINK@ +10%"), desc="Raise Volume Up"),
    Key([], "XF86AudioLowerVolume",
        lazy.spawn("pactl set-sink-volume @DEFAULT_SINK@ -10%"), desc="Raise Volume Down"),
    Key([], "XF86AudioMute",
        lazy.spawn("pactl set-sink-mute @DEFAULT_SINK@ toggle"), desc="Toggle Audio Mute"),
    Key([], "XF86AudioMicMute",
        lazy.spawn("pactl set-source-mute @DEFAULT_SOURCE@ toggle"), desc="Toggle Audio Mic Mute"),

    Key([], "XF86AudioPlay",
        lazy.spawn("playerctl play-pause"), desc="Toggle play/pause"),
    Key([], "XF86AudioPrev",
        lazy.spawn("playerctl previous"), desc="Previous"),
    Key([], "XF86AudioNext",
        lazy.spawn("playerctl next"), desc="Next"),
    # TODO: XF86Tools for Audio
    Key([], "XF86Calculator",
        lazy.spawn("rofi -show calc -modi calc -no-show-match -no-sort"), desc="Calculator"),

    Key([], "XF86HomePage",
        lazy.spawn(browser), desc="Browser"),
    Key([mod, "mod1"], "b",
        lazy.spawn(browser), desc="Browser"),
    Key([], "XF86Mail",
        lazy.spawn(mail), desc="Mail Client"),
    Key([], "XF86Search",
        lazy.spawn("rofi-search"), desc="Search"),

    Key([], "Print",
        lazy.spawn("flameshot gui"), desc="flameshot"),

    Key([mod, "mod1"], "v", lazy.spawn("neovide"), desc="neovide"),
    Key([mod, "mod1"], "p", lazy.spawn("rofi-pass"), desc="rofi pass"),
    Key([mod, "mod1"], "n", lazy.spawn("emacsclient -c -a emacs"), desc="emacs"),
    Key([mod, "mod1"], "s", lazy.spawn("screenkey"), desc="screenkey"),

    Key([mod], "e", lazy.spawn(filemanager), desc="file-manager"),
    Key([mod], "Return", lazy.spawn(terminal), desc="Launch terminal"),
    Key([mod, "shift"], "Return", lazy.spawn(f"{terminal} -e tmux new -A -s main"), desc="Tmux"),
    Key(["mod1"], "F4", lazy.window.kill(), desc="kill focused window"),
    Key([mod], "F4", lazy.window.kill(), desc="kill focused window"),
    Key([mod], "d", lazy.spawn("rofi -show drun"), desc="rofi menu"),
    Key([mod], "c",
        lazy.spawn("rofi -modi 'clipboard:greenclip print' -show clipboard"),
        desc="rofi greenclip"),
    Key([mod, "shift"], "w",
        lazy.spawn("rofi -show windowcd"), desc="rofi windowcd"),
    Key([mod], "w",
        lazy.spawn("rofi -show window"), desc="rofi window"),
    Key([mod], "q",
        lazy.spawn("rofi -show p -modi p:'rofi-power-menu --symbols-font \"Symbols Nerd Font Mono\"' -font 'OverpassM Nerd Font Mono' -theme catppuccin-default -theme-str 'window {width: 8em;} listview {lines: 6;}'"), desc="rofi-power-menu"),
    Key([mod], "period", lazy.spawn("rofimoji"), desc="rofimoji"),
    # Key([mod, "shift"], "t", lazy.spawn(ocr()), desc="ocr"),
]
#+end_src
