index.html
<div id="outline-container-org76f4f02" class="outline-4">
<h4 id="org76f4f02"><span class="section-number-4">1.1.7.</span> Keys</h4>
<div class="outline-text-4" id="text-1-1-7">
<div class="org-src-container">
<pre class="src src-python"><span class="linenr"> 23: </span><span style="color: #b8860b;">keys</span> = [
<span class="linenr"> 24: </span>    <span style="color: #b22222;"># </span><span style="color: #b22222;">A list of available commands that can be bound to keys can be found
<span class="linenr"> 25: </span></span>    <span style="color: #b22222;"># </span><span style="color: #b22222;">at https://docs.qtile.org/en/latest/manual/config/lazy.html
<span class="linenr"> 26: </span></span>    <span style="color: #b22222;"># </span><span style="color: #b22222;">Switch between windows
<span class="linenr"> 27: </span></span>    Key([mod], <span style="color: #bc8f8f;">"h"</span>, lazy.layout.left(), desc=<span style="color: #bc8f8f;">"Move focus to left"</span>),
<span class="linenr"> 28: </span>    Key([mod], <span style="color: #bc8f8f;">"l"</span>, lazy.layout.right(), desc=<span style="color: #bc8f8f;">"Move focus to right"</span>),
<span class="linenr"> 29: </span>    Key([mod], <span style="color: #bc8f8f;">"j"</span>, lazy.layout.down(), desc=<span style="color: #bc8f8f;">"Move focus down"</span>),
<span class="linenr"> 30: </span>    Key([mod], <span style="color: #bc8f8f;">"k"</span>, lazy.layout.up(), desc=<span style="color: #bc8f8f;">"Move focus up"</span>),
<span class="linenr"> 31: </span>    Key([mod], <span style="color: #bc8f8f;">"space"</span>, lazy.layout.<span style="color: #00008b;">next</span>(), desc=<span style="color: #bc8f8f;">"Move window focus to other window"</span>),
<span class="linenr"> 32: </span>    Key([<span style="color: #bc8f8f;">"mod1"</span>], <span style="color: #bc8f8f;">"Tab"</span>, lazy.layout.<span style="color: #00008b;">next</span>(), desc=<span style="color: #bc8f8f;">"Move window focus to other window"</span>),
<span class="linenr"> 33: </span>    <span style="color: #b22222;"># </span><span style="color: #b22222;">Move windows between left/right columns or move up/down in current stack.
<span class="linenr"> 34: </span></span>    <span style="color: #b22222;"># </span><span style="color: #b22222;">Moving out of range in Columns layout will create new column.
<span class="linenr"> 35: </span></span>    Key([mod, <span style="color: #bc8f8f;">"shift"</span>], <span style="color: #bc8f8f;">"h"</span>, lazy.layout.shuffle_left(), desc=<span style="color: #bc8f8f;">"Move window to the left"</span>),
<span class="linenr"> 36: </span>    Key([mod, <span style="color: #bc8f8f;">"shift"</span>], <span style="color: #bc8f8f;">"l"</span>, lazy.layout.shuffle_right(), desc=<span style="color: #bc8f8f;">"Move window to the right"</span>),
<span class="linenr"> 37: </span>    Key([mod, <span style="color: #bc8f8f;">"shift"</span>], <span style="color: #bc8f8f;">"j"</span>, lazy.layout.shuffle_down(), desc=<span style="color: #bc8f8f;">"Move window down"</span>),
<span class="linenr"> 38: </span>    Key([mod, <span style="color: #bc8f8f;">"shift"</span>], <span style="color: #bc8f8f;">"k"</span>, lazy.layout.shuffle_up(), desc=<span style="color: #bc8f8f;">"Move window up"</span>),
<span class="linenr"> 39: </span>    <span style="color: #b22222;"># </span><span style="color: #b22222;">Grow windows. If current window is on the edge of screen and direction
<span class="linenr"> 40: </span></span>    <span style="color: #b22222;"># </span><span style="color: #b22222;">will be to screen edge - window would shrink.
<span class="linenr"> 41: </span></span>    Key([mod, <span style="color: #bc8f8f;">"control"</span>], <span style="color: #bc8f8f;">"h"</span>, lazy.layout.grow_left(), desc=<span style="color: #bc8f8f;">"Grow window to the left"</span>),
<span class="linenr"> 42: </span>    Key([mod, <span style="color: #bc8f8f;">"control"</span>], <span style="color: #bc8f8f;">"l"</span>, lazy.layout.grow_right(), desc=<span style="color: #bc8f8f;">"Grow window to the right"</span>),
<span class="linenr"> 43: </span>    Key([mod, <span style="color: #bc8f8f;">"control"</span>], <span style="color: #bc8f8f;">"j"</span>, lazy.layout.grow_down(), desc=<span style="color: #bc8f8f;">"Grow window down"</span>),
<span class="linenr"> 44: </span>    Key([mod, <span style="color: #bc8f8f;">"control"</span>], <span style="color: #bc8f8f;">"k"</span>, lazy.layout.grow_up(), desc=<span style="color: #bc8f8f;">"Grow window up"</span>),
<span class="linenr"> 45: </span>    Key([mod], <span style="color: #bc8f8f;">"n"</span>, lazy.layout.normalize(), desc=<span style="color: #bc8f8f;">"Reset all window sizes"</span>),
<span class="linenr"> 46: </span>    <span style="color: #b22222;"># </span><span style="color: #b22222;">Toggle between split and unsplit sides of stack.
<span class="linenr"> 47: </span></span>    <span style="color: #b22222;"># </span><span style="color: #b22222;">Split = all windows displayed
<span class="linenr"> 48: </span></span>    <span style="color: #b22222;"># </span><span style="color: #b22222;">Unsplit = 1 window displayed, like Max layout, but still with
<span class="linenr"> 49: </span></span>    <span style="color: #b22222;"># </span><span style="color: #b22222;">multiple stack panes
<span class="linenr"> 50: </span></span>    Key(
<span class="linenr"> 51: </span>        [mod, <span style="color: #bc8f8f;">"shift"</span>],
<span class="linenr"> 52: </span>        <span style="color: #bc8f8f;">"Return"</span>,
<span class="linenr"> 53: </span>        lazy.layout.toggle_split(),
<span class="linenr"> 54: </span>        desc=<span style="color: #bc8f8f;">"Toggle between split and unsplit sides of stack"</span>,
<span class="linenr"> 55: </span>    ),
<span class="linenr"> 56: </span>    <span style="color: #b22222;"># </span><span style="color: #b22222;">Toggle between different layouts as defined below
<span class="linenr"> 57: </span></span>    Key([mod], <span style="color: #bc8f8f;">"Tab"</span>, lazy.screen.toggle_group(), desc=<span style="color: #bc8f8f;">"Toggle between groups"</span>),
<span class="linenr"> 58: </span>    Key([mod, <span style="color: #bc8f8f;">"mod1"</span>], <span style="color: #bc8f8f;">"Tab"</span>, lazy.next_layout(), desc=<span style="color: #bc8f8f;">"Toggle between layouts"</span>),
<span class="linenr"> 59: </span>    <span style="color: #b22222;"># </span><span style="color: #b22222;">Key([mod], "w", lazy.window.kill(), desc="Kill focused window"),
<span class="linenr"> 60: </span></span>    Key(
<span class="linenr"> 61: </span>        [mod],
<span class="linenr"> 62: </span>        <span style="color: #bc8f8f;">"f"</span>,
<span class="linenr"> 63: </span>        lazy.window.toggle_fullscreen(),
<span class="linenr"> 64: </span>        desc=<span style="color: #bc8f8f;">"Toggle fullscreen on the focused window"</span>,
<span class="linenr"> 65: </span>    ),
<span class="linenr"> 66: </span>    Key([mod], <span style="color: #bc8f8f;">"t"</span>, lazy.window.toggle_floating(), desc=<span style="color: #bc8f8f;">"Toggle floating on the focused window"</span>),
<span class="linenr"> 67: </span>    Key([mod, <span style="color: #bc8f8f;">"control"</span>], <span style="color: #bc8f8f;">"r"</span>, lazy.reload_config(), desc=<span style="color: #bc8f8f;">"Reload the config"</span>),
<span class="linenr"> 68: </span>    Key([mod, <span style="color: #bc8f8f;">"control"</span>], <span style="color: #bc8f8f;">"q"</span>, lazy.shutdown(), desc=<span style="color: #bc8f8f;">"Shutdown Qtile"</span>),
<span class="linenr"> 69: </span>    Key([mod], <span style="color: #bc8f8f;">"r"</span>, lazy.spawncmd(), desc=<span style="color: #bc8f8f;">"Spawn a command using a prompt widget"</span>),
<span class="linenr"> 70: </span>    Key([mod], <span style="color: #bc8f8f;">"bracketleft"</span>, lazy.to_screen(0)),
<span class="linenr"> 71: </span>    Key([mod], <span style="color: #bc8f8f;">"bracketright"</span>, lazy.to_screen(1)),
<span class="linenr"> 72: </span>
<span class="linenr"> 73: </span>    Key([], <span style="color: #bc8f8f;">"XF86AudioRaiseVolume"</span>,
<span class="linenr"> 74: </span>        lazy.spawn(<span style="color: #bc8f8f;">"pactl set-sink-volume @DEFAULT_SINK@ +10%"</span>), desc=<span style="color: #bc8f8f;">"Raise Volume Up"</span>),
<span class="linenr"> 75: </span>    Key([], <span style="color: #bc8f8f;">"XF86AudioLowerVolume"</span>,
<span class="linenr"> 76: </span>        lazy.spawn(<span style="color: #bc8f8f;">"pactl set-sink-volume @DEFAULT_SINK@ -10%"</span>), desc=<span style="color: #bc8f8f;">"Raise Volume Down"</span>),
<span class="linenr"> 77: </span>    Key([], <span style="color: #bc8f8f;">"XF86AudioMute"</span>,
<span class="linenr"> 78: </span>        lazy.spawn(<span style="color: #bc8f8f;">"pactl set-sink-mute @DEFAULT_SINK@ toggle"</span>), desc=<span style="color: #bc8f8f;">"Toggle Audio Mute"</span>),
<span class="linenr"> 79: </span>    Key([], <span style="color: #bc8f8f;">"XF86AudioMicMute"</span>,
<span class="linenr"> 80: </span>        lazy.spawn(<span style="color: #bc8f8f;">"pactl set-source-mute @DEFAULT_SOURCE@ toggle"</span>), desc=<span style="color: #bc8f8f;">"Toggle Audio Mic Mute"</span>),
<span class="linenr"> 81: </span>
<span class="linenr"> 82: </span>    Key([], <span style="color: #bc8f8f;">"XF86AudioPlay"</span>,
<span class="linenr"> 83: </span>        lazy.spawn(<span style="color: #bc8f8f;">"playerctl play-pause"</span>), desc=<span style="color: #bc8f8f;">"Toggle play/pause"</span>),
<span class="linenr"> 84: </span>    Key([], <span style="color: #bc8f8f;">"XF86AudioPrev"</span>,
<span class="linenr"> 85: </span>        lazy.spawn(<span style="color: #bc8f8f;">"playerctl previous"</span>), desc=<span style="color: #bc8f8f;">"Previous"</span>),
<span class="linenr"> 86: </span>    Key([], <span style="color: #bc8f8f;">"XF86AudioNext"</span>,
<span class="linenr"> 87: </span>        lazy.spawn(<span style="color: #bc8f8f;">"playerctl next"</span>), desc=<span style="color: #bc8f8f;">"Next"</span>),
<span class="linenr"> 88: </span>    <span style="color: #b22222;"># </span><span style="color: #b22222;">TODO: XF86Tools for Audio
<span class="linenr"> 89: </span></span>    Key([], <span style="color: #bc8f8f;">"XF86Calculator"</span>,
<span class="linenr"> 90: </span>        lazy.spawn(<span style="color: #bc8f8f;">"rofi -show calc -modi calc -no-show-match -no-sort"</span>), desc=<span style="color: #bc8f8f;">"Calculator"</span>),
<span class="linenr"> 91: </span>
<span class="linenr"> 92: </span>    Key([], <span style="color: #bc8f8f;">"XF86HomePage"</span>,
<span class="linenr"> 93: </span>        lazy.spawn(browser), desc=<span style="color: #bc8f8f;">"Browser"</span>),
<span class="linenr"> 94: </span>    Key([mod, <span style="color: #bc8f8f;">"mod1"</span>], <span style="color: #bc8f8f;">"b"</span>,
<span class="linenr"> 95: </span>        lazy.spawn(browser), desc=<span style="color: #bc8f8f;">"Browser"</span>),
<span class="linenr"> 96: </span>    Key([], <span style="color: #bc8f8f;">"XF86Mail"</span>,
<span class="linenr"> 97: </span>        lazy.spawn(mail), desc=<span style="color: #bc8f8f;">"Mail Client"</span>),
<span class="linenr"> 98: </span>    Key([], <span style="color: #bc8f8f;">"XF86Search"</span>,
<span class="linenr"> 99: </span>        lazy.spawn(<span style="color: #bc8f8f;">"rofi-search"</span>), desc=<span style="color: #bc8f8f;">"Search"</span>),
<span class="linenr">100: </span>
<span class="linenr">101: </span>    Key([], <span style="color: #bc8f8f;">"Print"</span>,
<span class="linenr">102: </span>        lazy.spawn(<span style="color: #bc8f8f;">"flameshot gui"</span>), desc=<span style="color: #bc8f8f;">"flameshot"</span>),
<span class="linenr">103: </span>
<span class="linenr">104: </span>    Key([mod, <span style="color: #bc8f8f;">"mod1"</span>], <span style="color: #bc8f8f;">"v"</span>, lazy.spawn(<span style="color: #bc8f8f;">"neovide"</span>), desc=<span style="color: #bc8f8f;">"neovide"</span>),
<span class="linenr">105: </span>    Key([mod, <span style="color: #bc8f8f;">"mod1"</span>], <span style="color: #bc8f8f;">"p"</span>, lazy.spawn(<span style="color: #bc8f8f;">"rofi-pass"</span>), desc=<span style="color: #bc8f8f;">"rofi pass"</span>),
<span class="linenr">106: </span>    Key([mod, <span style="color: #bc8f8f;">"mod1"</span>], <span style="color: #bc8f8f;">"n"</span>, lazy.spawn(<span style="color: #bc8f8f;">"emacsclient -c -a emacs"</span>), desc=<span style="color: #bc8f8f;">"emacs"</span>),
<span class="linenr">107: </span>    Key([mod, <span style="color: #bc8f8f;">"mod1"</span>], <span style="color: #bc8f8f;">"s"</span>, lazy.spawn(<span style="color: #bc8f8f;">"screenkey"</span>), desc=<span style="color: #bc8f8f;">"screenkey"</span>),
<span class="linenr">108: </span>
<span class="linenr">109: </span>    Key([mod], <span style="color: #bc8f8f;">"e"</span>, lazy.spawn(filemanager), desc=<span style="color: #bc8f8f;">"file-manager"</span>),
<span class="linenr">110: </span>    Key([mod], <span style="color: #bc8f8f;">"Return"</span>, lazy.spawn(terminal), desc=<span style="color: #bc8f8f;">"Launch terminal"</span>),
<span class="linenr">111: </span>    Key([mod, <span style="color: #bc8f8f;">"shift"</span>], <span style="color: #bc8f8f;">"Return"</span>, lazy.spawn(f<span style="color: #bc8f8f;">"</span>{terminal}<span style="color: #bc8f8f;"> -e tmux new -A -s main"</span>), desc=<span style="color: #bc8f8f;">"Tmux"</span>),
<span class="linenr">112: </span>    Key([<span style="color: #bc8f8f;">"mod1"</span>], <span style="color: #bc8f8f;">"F4"</span>, lazy.window.kill(), desc=<span style="color: #bc8f8f;">"kill focused window"</span>),
<span class="linenr">113: </span>    Key([mod], <span style="color: #bc8f8f;">"F4"</span>, lazy.window.kill(), desc=<span style="color: #bc8f8f;">"kill focused window"</span>),
<span class="linenr">114: </span>    Key([mod], <span style="color: #bc8f8f;">"d"</span>, lazy.spawn(<span style="color: #bc8f8f;">"rofi -show drun"</span>), desc=<span style="color: #bc8f8f;">"rofi menu"</span>),
<span class="linenr">115: </span>    Key([mod], <span style="color: #bc8f8f;">"c"</span>,
<span class="linenr">116: </span>        lazy.spawn(<span style="color: #bc8f8f;">"rofi -modi 'clipboard:greenclip print' -show clipboard"</span>),
<span class="linenr">117: </span>        desc=<span style="color: #bc8f8f;">"rofi greenclip"</span>),
<span class="linenr">118: </span>    Key([mod, <span style="color: #bc8f8f;">"shift"</span>], <span style="color: #bc8f8f;">"w"</span>,
<span class="linenr">119: </span>        lazy.spawn(<span style="color: #bc8f8f;">"rofi -show windowcd"</span>), desc=<span style="color: #bc8f8f;">"rofi windowcd"</span>),
<span class="linenr">120: </span>    Key([mod], <span style="color: #bc8f8f;">"w"</span>,
<span class="linenr">121: </span>        lazy.spawn(<span style="color: #bc8f8f;">"rofi -show window"</span>), desc=<span style="color: #bc8f8f;">"rofi window"</span>),
<span class="linenr">122: </span>    Key([mod], <span style="color: #bc8f8f;">"q"</span>,
<span class="linenr">123: </span>        lazy.spawn(<span style="color: #bc8f8f;">"rofi -show p -modi p:'rofi-power-menu --symbols-font \"Symbols Nerd Font Mono\"' -font 'OverpassM Nerd Font Mono' -theme catppuccin-default -theme-str 'window {width: 8em;} listview {lines: 6;}'"</span>), desc=<span style="color: #bc8f8f;">"rofi-power-menu"</span>),
<span class="linenr">124: </span>    Key([mod], <span style="color: #bc8f8f;">"period"</span>, lazy.spawn(<span style="color: #bc8f8f;">"rofimoji"</span>), desc=<span style="color: #bc8f8f;">"rofimoji"</span>),
<span class="linenr">125: </span>    <span style="color: #b22222;"># </span><span style="color: #b22222;">Key([mod, "shift"], "t", lazy.spawn(ocr()), desc="ocr"),
<span class="linenr">126: </span></span>]
</pre>
</div>
</div>
</div>
