index.html
<div id="outline-container-orga3d7dba" class="outline-2">
<h2 id="orga3d7dba"><span class="section-number-2">2.</span> Picom</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org8e68ce1" class="outline-3">
<h3 id="org8e68ce1"><span class="section-number-3">2.1.</span> picom.conf</h3>
<div class="outline-text-3" id="text-2-1">
</div>
<div id="outline-container-org40aaa20" class="outline-4">
<h4 id="org40aaa20"><span class="section-number-4">2.1.1.</span> shadows</h4>
<div class="outline-text-4" id="text-2-1-1">
<div class="org-src-container">
<pre class="src src-conf-unix"><span class="linenr"> 1: </span><span style="color: #b22222;"># </span><span style="color: #b22222;">Enabled client-side shadows on windows. Note desktop windows
<span class="linenr"> 2: </span></span><span style="color: #b22222;"># </span><span style="color: #b22222;">(windows with '_NET_WM_WINDOW_TYPE_DESKTOP') never get shadow,
<span class="linenr"> 3: </span></span><span style="color: #b22222;"># </span><span style="color: #b22222;">unless explicitly requested using the wintypes option.
<span class="linenr"> 4: </span></span><span style="color: #b22222;">#</span><span style="color: #b22222;">
<span class="linenr"> 5: </span></span><span style="color: #b22222;"># </span><span style="color: #b22222;">Can be set per-window using rules.
<span class="linenr"> 6: </span></span><span style="color: #b22222;">#</span><span style="color: #b22222;">
<span class="linenr"> 7: </span></span><span style="color: #b22222;"># </span><span style="color: #b22222;">Default: false
<span class="linenr"> 8: </span></span><span style="color: #b8860b;">shadow</span> = true;
<span class="linenr"> 9: </span>
<span class="linenr">10: </span><span style="color: #b22222;"># </span><span style="color: #b22222;">The blur radius for shadows, in pixels.
<span class="linenr">11: </span></span><span style="color: #b22222;">#</span><span style="color: #b22222;">
<span class="linenr">12: </span></span><span style="color: #b22222;"># </span><span style="color: #b22222;">Default: 12
<span class="linenr">13: </span></span><span style="color: #b8860b;">shadow-radius</span> = 7;
<span class="linenr">14: </span>
<span class="linenr">15: </span><span style="color: #b22222;"># </span><span style="color: #b22222;">The opacity of shadows.
<span class="linenr">16: </span></span><span style="color: #b22222;">#</span><span style="color: #b22222;">
<span class="linenr">17: </span></span><span style="color: #b22222;"># </span><span style="color: #b22222;">Range: 0.0 - 1.0
<span class="linenr">18: </span></span><span style="color: #b22222;"># </span><span style="color: #b22222;">Default: 0.75
<span class="linenr">19: </span></span><span style="color: #b22222;"># </span><span style="color: #b22222;">shadow-opacity = .75
<span class="linenr">20: </span></span>
<span class="linenr">21: </span><span style="color: #b22222;"># </span><span style="color: #b22222;">The left offset for shadows, in pixels.
<span class="linenr">22: </span></span><span style="color: #b22222;">#</span><span style="color: #b22222;">
<span class="linenr">23: </span></span><span style="color: #b22222;"># </span><span style="color: #b22222;">Default: -15
<span class="linenr">24: </span></span><span style="color: #b8860b;">shadow-offset-x</span> = -7;
<span class="linenr">25: </span>
<span class="linenr">26: </span><span style="color: #b22222;"># </span><span style="color: #b22222;">The top offset for shadows, in pixels.
<span class="linenr">27: </span></span><span style="color: #b22222;">#</span><span style="color: #b22222;">
<span class="linenr">28: </span></span><span style="color: #b22222;"># </span><span style="color: #b22222;">Default: -15
<span class="linenr">29: </span></span><span style="color: #b8860b;">shadow-offset-y</span> = -7;
<span class="linenr">30: </span>
<span class="linenr">31: </span><span style="color: #b22222;"># </span><span style="color: #b22222;">Hex string color value of shadow. Formatted like "#RRGGBB", e.g. "#C0FFEE".
<span class="linenr">32: </span></span><span style="color: #b22222;">#</span><span style="color: #b22222;">
<span class="linenr">33: </span></span><span style="color: #b22222;"># </span><span style="color: #b22222;">Default: #000000
<span class="linenr">34: </span></span><span style="color: #b22222;"># </span><span style="color: #b22222;">shadow-color = "#000000"
<span class="linenr">35: </span></span>
<span class="linenr">36: </span><span style="color: #b22222;"># </span><span style="color: #b22222;">Crop shadow of a window fully on a particular monitor to that monitor. This is
<span class="linenr">37: </span></span><span style="color: #b22222;"># </span><span style="color: #b22222;">currently implemented using the X RandR extension.
<span class="linenr">38: </span></span><span style="color: #b22222;">#</span><span style="color: #b22222;">
<span class="linenr">39: </span></span><span style="color: #b22222;"># </span><span style="color: #b22222;">Default: false
<span class="linenr">40: </span></span><span style="color: #b22222;"># </span><span style="color: #b22222;">crop-shadow-to-monitor = false</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org2da2939" class="outline-4">
<h4 id="org2da2939"><span class="section-number-4">2.1.2.</span> fading</h4>
<div class="outline-text-4" id="text-2-1-2">
<div class="org-src-container">
<pre class="src src-conf-unix"><span class="linenr">41: </span><span style="color: #b22222;"># </span><span style="color: #b22222;">Fade windows in/out when opening/closing and when opacity changes,
<span class="linenr">42: </span></span><span style="color: #b22222;"># </span><span style="color: #b22222;">unless no-fading-openclose is used. Can be set per-window using rules.
<span class="linenr">43: </span></span><span style="color: #b22222;">#</span><span style="color: #b22222;">
<span class="linenr">44: </span></span><span style="color: #b22222;"># </span><span style="color: #b22222;">Default: false
<span class="linenr">45: </span></span><span style="color: #b8860b;">fading</span> = true;
<span class="linenr">46: </span>
<span class="linenr">47: </span><span style="color: #b22222;"># </span><span style="color: #b22222;">Opacity change between steps while fading in. (0.01 - 1.0, defaults to 0.028)
<span class="linenr">48: </span></span><span style="color: #b8860b;">fade-in-step</span> = 0.03;
<span class="linenr">49: </span>
<span class="linenr">50: </span><span style="color: #b22222;"># </span><span style="color: #b22222;">Opacity change between steps while fading out. (0.01 - 1.0, defaults to 0.03)
<span class="linenr">51: </span></span><span style="color: #b8860b;">fade-out-step</span> = 0.03;
<span class="linenr">52: </span>
<span class="linenr">53: </span><span style="color: #b22222;"># </span><span style="color: #b22222;">The time between steps in fade step, in milliseconds. (&gt; 0, defaults to 10)
<span class="linenr">54: </span></span><span style="color: #b22222;"># </span><span style="color: #b22222;">fade-delta = 10
<span class="linenr">55: </span></span>
<span class="linenr">56: </span><span style="color: #b22222;"># </span><span style="color: #b22222;">Do not fade on window open/close.
<span class="linenr">57: </span></span><span style="color: #b22222;"># </span><span style="color: #b22222;">no-fading-openclose = false
<span class="linenr">58: </span></span>
<span class="linenr">59: </span><span style="color: #b22222;"># </span><span style="color: #b22222;">Do not fade destroyed ARGB windows with WM frame. Workaround of bugs in Openbox, Fluxbox, etc.
<span class="linenr">60: </span></span><span style="color: #b22222;"># </span><span style="color: #b22222;">no-fading-destroyed-argb = false</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgdabba8b" class="outline-4">
<h4 id="orgdabba8b"><span class="section-number-4">2.1.3.</span> transparency / opacity</h4>
<div class="outline-text-4" id="text-2-1-3">
<div class="org-src-container">
<pre class="src src-conf-unix"><span class="linenr">61: </span><span style="color: #b22222;"># </span><span style="color: #b22222;">Opacity of window titlebars and borders.
<span class="linenr">62: </span></span><span style="color: #b22222;">#</span><span style="color: #b22222;">
<span class="linenr">63: </span></span><span style="color: #b22222;"># </span><span style="color: #b22222;">Range: 0.1 - 1.0
<span class="linenr">64: </span></span><span style="color: #b22222;"># </span><span style="color: #b22222;">Default: 1.0 (disabled)
<span class="linenr">65: </span></span><span style="color: #b8860b;">frame-opacity</span> = 0.9;
<span class="linenr">66: </span>
<span class="linenr">67: </span><span style="color: #b22222;"># </span><span style="color: #b22222;">Use fixed inactive dim value, instead of adjusting according to window opacity.
<span class="linenr">68: </span></span><span style="color: #b22222;">#</span><span style="color: #b22222;">
<span class="linenr">69: </span></span><span style="color: #b22222;"># </span><span style="color: #b22222;">Default: false
<span class="linenr">70: </span></span><span style="color: #b22222;"># </span><span style="color: #b22222;">inactive-dim-fixed = true</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org3301ce8" class="outline-4">
<h4 id="org3301ce8"><span class="section-number-4">2.1.4.</span> corners</h4>
<div class="outline-text-4" id="text-2-1-4">
<div class="org-src-container">
<pre class="src src-conf-unix"><span class="linenr">71: </span><span style="color: #b22222;"># </span><span style="color: #b22222;">Sets the radius of rounded window corners. When &gt; 0, the compositor will
<span class="linenr">72: </span></span><span style="color: #b22222;"># </span><span style="color: #b22222;">round the corners of windows. Does not interact well with
<span class="linenr">73: </span></span><span style="color: #b22222;"># </span><span style="color: #b22222;">`transparent-clipping`.
<span class="linenr">74: </span></span><span style="color: #b22222;">#</span><span style="color: #b22222;">
<span class="linenr">75: </span></span><span style="color: #b22222;"># </span><span style="color: #b22222;">Default: 0 (disabled)
<span class="linenr">76: </span></span><span style="color: #b8860b;">corner-radius</span> = 0
</pre>
</div>
</div>
</div>
