index.html
<div id="outline-container-orge52a281" class="outline-2">
<h2 id="orge52a281"><span class="section-number-2">4.</span> Rofi</h2>
<div class="outline-text-2" id="text-4">
</div>
<div id="outline-container-orgbe2031a" class="outline-3">
<h3 id="orgbe2031a"><span class="section-number-3">4.1.</span> config.rasi</h3>
<div class="outline-text-3" id="text-4-1">
<div class="org-src-container">
<pre class="src src-css"><span style="color: #b22222;">/* </span><span style="color: #b22222;">-*- mode: css; eval: (rainbow-mode +1) -*-</span><span style="color: #b22222;"> */</span>
<span style="color: #00008b;">@theme</span> <span style="color: #bc8f8f;">"catppuccin-default"</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org41b021c" class="outline-3">
<h3 id="org41b021c"><span class="section-number-3">4.2.</span> catppuccin-default.rasi</h3>
<div class="outline-text-3" id="text-4-2">
<div class="org-src-container">
<pre class="src src-css"><span style="color: #b22222;">/* </span><span style="color: #b22222;">-*- mode: css; eval: (rainbow-mode +1) -*-</span><span style="color: #b22222;"> */</span>
<span style="color: #00008b;">@import</span> <span style="color: #bc8f8f;">"catppuccin-mocha"</span>

<span style="color: #0000ff;">*</span> {
  <span style="color: #4169e1;">selected-active-foreground</span>:  <span style="color: #00008b;">@background</span>;
  <span style="color: #4169e1;">lightfg</span>:                     <span style="color: #00008b;">@text</span>;
  <span style="color: #4169e1;">separatorcolor</span>:              <span style="color: #00008b;">@foreground</span>;
  <span style="color: #4169e1;">urgent-foreground</span>:           <span style="color: #00008b;">@red</span>;
  <span style="color: #4169e1;">alternate-urgent-background</span>: <span style="color: #00008b;">@lightbg</span>;
  <span style="color: #4169e1;">lightbg</span>:                     <span style="color: #00008b;">@mantle</span>;
  <span style="color: #4169e1;">background-color</span>:            transparent;
  <span style="color: #4169e1;">border-color</span>:                <span style="color: #00008b;">@foreground</span>;
  <span style="color: #4169e1;">normal-background</span>:           <span style="color: #00008b;">@background</span>;
  <span style="color: #4169e1;">selected-urgent-background</span>:  <span style="color: #00008b;">@red</span>;
  <span style="color: #4169e1;">alternate-active-background</span>: <span style="color: #00008b;">@lightbg</span>;
  <span style="color: #4169e1;">spacing</span>:                     2;
  <span style="color: #4169e1;">alternate-normal-foreground</span>: <span style="color: #00008b;">@foreground</span>;
  <span style="color: #4169e1;">urgent-background</span>:           <span style="color: #00008b;">@background</span>;
  <span style="color: #4169e1;">selected-normal-foreground</span>:  <span style="color: #00008b;">@lightbg</span>;
  <span style="color: #4169e1;">active-foreground</span>:           <span style="color: #00008b;">@blue</span>;
  <span style="color: #4169e1;">background</span>:                  <span style="color: #00008b;">@base</span>;
  <span style="color: #4169e1;">selected-active-background</span>:  <span style="color: #00008b;">@blue</span>;
  <span style="color: #4169e1;">active-background</span>:           <span style="color: #00008b;">@background</span>;
  <span style="color: #4169e1;">selected-normal-background</span>:  <span style="color: #00008b;">@lightfg</span>;
  <span style="color: #4169e1;">alternate-normal-background</span>: <span style="color: #00008b;">@lightbg</span>;
  <span style="color: #4169e1;">foreground</span>:                  <span style="color: #00008b;">@text</span>;
  <span style="color: #4169e1;">selected-urgent-foreground</span>:  <span style="color: #00008b;">@background</span>;
  <span style="color: #4169e1;">normal-foreground</span>:           <span style="color: #00008b;">@foreground</span>;
  <span style="color: #4169e1;">alternate-urgent-foreground</span>: <span style="color: #00008b;">@red</span>;
  <span style="color: #4169e1;">alternate-active-foreground</span>: <span style="color: #00008b;">@blue</span>;

}
<span style="color: #0000ff;">element</span> {
    <span style="color: #4169e1;">padding</span>: 1px ;
    <span style="color: #4169e1;">cursor</span>:  pointer;
    <span style="color: #4169e1;">spacing</span>: 5px ;
    <span style="color: #4169e1;">border</span>:  0;
}
<span style="color: #0000ff;">element normal.normal</span> {
    <span style="color: #4169e1;">background-color</span>: <span style="color: #00008b;">@normal-background</span>;
    <span style="color: #4169e1;">text-color</span>:       <span style="color: #00008b;">@normal-foreground</span>;
}
<span style="color: #0000ff;">element normal.urgent</span> {
    <span style="color: #4169e1;">background-color</span>: <span style="color: #00008b;">@urgent-background</span>;
    <span style="color: #4169e1;">text-color</span>:       <span style="color: #00008b;">@urgent-foreground</span>;
}
<span style="color: #0000ff;">element normal.active</span> {
    <span style="color: #4169e1;">background-color</span>: <span style="color: #00008b;">@active-background</span>;
    <span style="color: #4169e1;">text-color</span>:       <span style="color: #00008b;">@active-foreground</span>;
}
<span style="color: #0000ff;">element selected.normal</span> {
    <span style="color: #4169e1;">background-color</span>: <span style="color: #00008b;">@selected-normal-background</span>;
    <span style="color: #4169e1;">text-color</span>:       <span style="color: #00008b;">@selected-normal-foreground</span>;
}
<span style="color: #0000ff;">element selected.urgent</span> {
    <span style="color: #4169e1;">background-color</span>: <span style="color: #00008b;">@selected-urgent-background</span>;
    <span style="color: #4169e1;">text-color</span>:       <span style="color: #00008b;">@selected-urgent-foreground</span>;
}
<span style="color: #0000ff;">element selected.active</span> {
    <span style="color: #4169e1;">background-color</span>: <span style="color: #00008b;">@selected-active-background</span>;
    <span style="color: #4169e1;">text-color</span>:       <span style="color: #00008b;">@selected-active-foreground</span>;
}
<span style="color: #0000ff;">element alternate.normal</span> {
    <span style="color: #4169e1;">background-color</span>: <span style="color: #00008b;">@alternate-normal-background</span>;
    <span style="color: #4169e1;">text-color</span>:       <span style="color: #00008b;">@alternate-normal-foreground</span>;
}
<span style="color: #0000ff;">element alternate.urgent</span> {
    <span style="color: #4169e1;">background-color</span>: <span style="color: #00008b;">@alternate-urgent-background</span>;
    <span style="color: #4169e1;">text-color</span>:       <span style="color: #00008b;">@alternate-urgent-foreground</span>;
}
<span style="color: #0000ff;">element alternate.active</span> {
    <span style="color: #4169e1;">background-color</span>: <span style="color: #00008b;">@alternate-active-background</span>;
    <span style="color: #4169e1;">text-color</span>:       <span style="color: #00008b;">@alternate-active-foreground</span>;
}
<span style="color: #0000ff;">element-text</span> {
    <span style="color: #4169e1;">background-color</span>: transparent;
    <span style="color: #4169e1;">cursor</span>:           inherit;
    <span style="color: #4169e1;">highlight</span>:        inherit;
    <span style="color: #4169e1;">text-color</span>:       inherit;
}
<span style="color: #0000ff;">element-icon</span> {
    <span style="color: #4169e1;">background-color</span>: transparent;
    <span style="color: #4169e1;">size</span>:             1.0000em ;
    <span style="color: #4169e1;">cursor</span>:           inherit;
    <span style="color: #4169e1;">text-color</span>:       inherit;
}
<span style="color: #0000ff;">window</span> {
    <span style="color: #4169e1;">padding</span>:          5;
    <span style="color: #4169e1;">background-color</span>: <span style="color: #00008b;">@background</span>;
    <span style="color: #4169e1;">border</span>:           1;
}
<span style="color: #0000ff;">mainbox</span> {
    <span style="color: #4169e1;">padding</span>: 0;
    <span style="color: #4169e1;">border</span>:  0;
}
<span style="color: #0000ff;">message</span> {
    <span style="color: #4169e1;">padding</span>:      1px ;
    <span style="color: #4169e1;">border-color</span>: <span style="color: #00008b;">@separatorcolor</span>;
    <span style="color: #4169e1;">border</span>:       2px dash 0px 0px ;
}
<span style="color: #0000ff;">textbox</span> {
    <span style="color: #4169e1;">text-color</span>: <span style="color: #00008b;">@foreground</span>;
}
<span style="color: #0000ff;">listview</span> {
    <span style="color: #4169e1;">padding</span>:      2px 0px 0px ;
    <span style="color: #4169e1;">scrollbar</span>:    true;
    <span style="color: #4169e1;">border-color</span>: <span style="color: #00008b;">@separatorcolor</span>;
    <span style="color: #4169e1;">spacing</span>:      2px ;
    <span style="color: #4169e1;">fixed-height</span>: 0;
    <span style="color: #4169e1;">border</span>:       2px dash 0px 0px ;
}
<span style="color: #0000ff;">scrollbar</span> {
    <span style="color: #4169e1;">width</span>:        4px ;
    <span style="color: #4169e1;">padding</span>:      0;
    <span style="color: #4169e1;">handle-width</span>: 8px ;
    <span style="color: #4169e1;">border</span>:       0;
    <span style="color: #4169e1;">handle-color</span>: <span style="color: #00008b;">@normal-foreground</span>;
}
<span style="color: #0000ff;">sidebar</span> {
    <span style="color: #4169e1;">border-color</span>: <span style="color: #00008b;">@separatorcolor</span>;
    <span style="color: #4169e1;">border</span>:       2px dash 0px 0px ;
}
<span style="color: #0000ff;">button</span> {
    <span style="color: #4169e1;">cursor</span>:     pointer;
    <span style="color: #4169e1;">spacing</span>:    0;
    <span style="color: #4169e1;">text-color</span>: <span style="color: #00008b;">@normal-foreground</span>;
}
<span style="color: #0000ff;">button selected</span> {
    <span style="color: #4169e1;">background-color</span>: <span style="color: #00008b;">@selected-normal-background</span>;
    <span style="color: #4169e1;">text-color</span>:       <span style="color: #00008b;">@selected-normal-foreground</span>;
}
<span style="color: #0000ff;">num-filtered-rows</span> {
    <span style="color: #4169e1;">expand</span>:     false;
    <span style="color: #4169e1;">text-color</span>: Gray;
}
<span style="color: #0000ff;">num-rows</span> {
    <span style="color: #4169e1;">expand</span>:     false;
    <span style="color: #4169e1;">text-color</span>: Gray;
}
<span style="color: #0000ff;">textbox-num-sep</span> {
    <span style="color: #4169e1;">expand</span>:     false;
    <span style="color: #4169e1;">str</span>:        <span style="color: #bc8f8f;">"/"</span>;
    <span style="color: #4169e1;">text-color</span>: Gray;
}
<span style="color: #0000ff;">inputbar</span> {
    <span style="color: #4169e1;">padding</span>:    1px ;
    <span style="color: #4169e1;">spacing</span>:    0px ;
    <span style="color: #4169e1;">text-color</span>: <span style="color: #00008b;">@normal-foreground</span>;
    <span style="color: #4169e1;">children</span>:   [ <span style="color: #bc8f8f;">"prompt"</span>,<span style="color: #bc8f8f;">"textbox-prompt-colon"</span>,<span style="color: #bc8f8f;">"entry"</span>,<span style="color: #bc8f8f;">"num-filtered-rows"</span>,<span style="color: #bc8f8f;">"textbox-num-sep"</span>,<span style="color: #bc8f8f;">"num-rows"</span>,<span style="color: #bc8f8f;">"case-indicator"</span> ];
}
<span style="color: #0000ff;">case-indicator</span> {
    <span style="color: #4169e1;">spacing</span>:    0;
    <span style="color: #4169e1;">text-color</span>: <span style="color: #00008b;">@normal-foreground</span>;
}
<span style="color: #0000ff;">entry</span> {
    <span style="color: #4169e1;">text-color</span>:        <span style="color: #00008b;">@normal-foreground</span>;
    <span style="color: #4169e1;">cursor</span>:            text;
    <span style="color: #4169e1;">spacing</span>:           0;
    <span style="color: #4169e1;">placeholder-color</span>: Gray;
    <span style="color: #4169e1;">placeholder</span>:       <span style="color: #bc8f8f;">"Type to filter"</span>;
}
<span style="color: #0000ff;">prompt</span> {
    <span style="color: #4169e1;">spacing</span>:    0;
    <span style="color: #4169e1;">text-color</span>: <span style="color: #00008b;">@normal-foreground</span>;
}
<span style="color: #0000ff;">textbox-prompt-colon</span> {
    <span style="color: #4169e1;">margin</span>:     0px 0.3000em 0.0000em 0.0000em ;
    <span style="color: #4169e1;">expand</span>:     false;
    <span style="color: #4169e1;">str</span>:        <span style="color: #bc8f8f;">":"</span>;
    <span style="color: #4169e1;">text-color</span>: inherit;
}

</pre>
</div>
</div>
</div>
